Documents/ОплатаБанковскойКартой.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ОплатаБанковскойКартой</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.ЗаказДоговор</xr:Item>
				<xr:Item>Document.СчетНаОплату</xr:Item>
				<xr:Item>Document.РеализацияТоваровИУслуг</xr:Item>
				<xr:Item>Document.Монтаж</xr:Item>
				<xr:Item>Document.ОплатаБанковскойКартой</xr:Item>
				<xr:Item>Document.ВозвратТовараОтПокупателя</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УДАЛИТЬ_ВзаиморасчетыСКонтрагентамиПоЗаказДоговорам</xr:Item>
				<xr:Item>AccumulationRegister.УДАЛИТЬ_ОплатаПоСчетам</xr:Item>
				<xr:Item>AccumulationRegister.БонусыКонтрагентов</xr:Item>
				<xr:Item>AccumulationRegister.УДАЛИТЬ_ОплатаЗаказовНаПроизводство</xr:Item>
				<xr:Item>AccumulationRegister.ДолгиПоРассрочкам</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЭквайрингу</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЗаказам</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентамиВВалюте</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентамиПоЗаказам</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанкВозвращаетКомиссиюПриВозвратеОплаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийОплатаБанковскойКартой</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлатежнойКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПлатежныхКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДисконтныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодАвторизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комиссия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КредитныйДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КредитныеДоговоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачислятьБонусы</Name>
					<Comment>Служебный реквизит</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПлатежнойКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>22</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСменыККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧекаККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаВыполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентКомиссии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебныйУчетБонусовПоДисконтнымКартам</Name>
					<Comment>Служебный реквизит</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДоходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБонусовКНачислениюПоДисконтнойКарте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬДатаПлатежаПоРассрочке</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬОплатаПоРассрочке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬСчетНаОплату</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧекФискализирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭквайринговыйТерминал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭквайринговыеТерминалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументНАНБ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НастройкаАвтоматическихНачисленийБонусов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданПриИспользованииПодразделений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РаспределениеПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежаПоРассрочке</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВВалютеДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСекции</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Основания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВозвратПродукции</v8:Type>
								<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ОплатаБанковскойКартой</v8:Type>
								<v8:Type>cfg:DocumentRef.Замена</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаявкаНаДоставку</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратТовараОтПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/РасчетыПоЗаказам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыПоЗаказам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыОперацийОплатаБанковскойКартой.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОперацийОплатаБанковскойКартой</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаБанковскойКартой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыКлиенту</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ОплатаБанковскойКартой/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ПеременныеФормы

&НаКлиенте
Перем СтараяСуммаДокумента Экспорт;

&НаКлиенте
Перем мСуммаБонусов;

&НаКлиенте
Перем ПараметрыДляЗаписи Экспорт;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	ЗаполнитьСтавкуНДСПоОрганизации(Истина);
	
	ДобавлятьЗаказыВторогоПорядкаВРаспределение = НЕ Константы.НеДобавлятьЗаказыВторогоПорядкаВРаспределение.Получить();
	ДобавлятьДокументыПродажиПоЗаказамПокупателей = ПолучитьФункциональнуюОпцию("ДобавлятьДокументПродажиПоЗаказуПриДобавленииЗаказаВРаспределение")
										И Константы.ВестиРасчетыПоЗаказамПоРТиУ.Получить();
	ДобавлятьДокументыПродажиПоЗаказДоговорам = ПолучитьФункциональнуюОпцию("ДобавлятьДокументПродажиПоЗаказуПриДобавленииЗаказаВРаспределение")
										И Константы.ВестиРасчетыПоЗаказамПоМонтажу.Получить();
										
	Если Параметры.Ключ.Пустая() тогда		
		ПересчитатьБонусыПоДокументу();
		//ЗаполнитьОснованияПоРаспределению(); //Заккоментировано по заявке #5186
		ПриЧтенииСозданииНаСервере(); // №11237
	Иначе
		ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);
	КонецЕсли;
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	МессенджерыСервер.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ГруппаКонтрагентКПМессенджеры);
	
	УстановитьЗаголовок();
	
	Элементы.ГруппаФискальныйРегистратор.Видимость = Константы.ИспользоватьПодключаемоеОборудование.Получить();
	Элементы.ФормаПечатьЧека.Видимость = Элементы.ГруппаФискальныйРегистратор.Видимость;
	Элементы.ФормаПоказатьТовары.Видимость = Элементы.ГруппаФискальныйРегистратор.Видимость;
	
	ОбновитьЭлементыФормы();
	
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);
	УстановитьВидимостьКнопокРаспределения();
		
	//Элементы.КонтрагентДополнительно.Видимость = Объект.Контрагент.ПоказыватьДопИнформацию;
	ОбщийМодульСервер.ДополнительнаяИнформацияПоКонтрагентуНаФорме(Объект.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	ОбщийМодульСервер.РегулировкаШириныПоляКонтрагента(Элементы, Элементы.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);

	ОбщийМодульСервер.УстановитьВидимостьПодразделения(ЭтотОбъект);
	
	УправлениеВидимостьюЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	ПриЧтенииСозданииНаСервере(); // №11237
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	ВалютаДокумента = Объект.Валюта;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьВидимостьГруппыБонусов();
	СтараяСуммаДокумента = Объект.Сумма;
	мСуммаБонусов = Объект.СуммаБонусовКНачислениюПоДисконтнойКарте;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НеВыполнятьПроверкуПередЗаписью Тогда
		НеВыполнятьПроверкуПередЗаписью = Ложь;
		Возврат;
	КонецЕсли;
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ВыполнитьПроверкиИЗадатьВопросыПередЗаписью(Отказ, ПараметрыЗаписи);
	КонецЕсли;
	
	ОбщийМодульКлиент.ЗаписатьОбъектПриНеобходимости(ЭтотОбъект, ПараметрыЗаписи, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
		
	ФинансыСервер.ПроверитьСуммуРаспределенияПоТипамДокументов(Объект, , Объект.Сумма, Отказ, ПараметрыЗаписи.РежимЗаписи);
	
	// #15647
	Если ЗаписьПослеПробития Тогда
		ЗаписьПослеПробития = Ложь;
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзмененияПроведенногоДокумента", Истина);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	мСуммаБонусов = Объект.СуммаБонусовКНачислениюПоДисконтнойКарте;
	Оповестить("ОбновитьАРМПроизводства",,"ОплатаБанковскойКартой");
	Оповестить("Запись_ДокументОплаты", , Объект.Ссылка);
	
	ОбщийМодульКлиент.ВыполнитьДействияПослеЗаписи(ЭтаФорма, Объект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьЗаголовок();
	ОбновитьЭлементыФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ДатаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	Если НЕ Объект.Валюта = ВалютаУчета Тогда
		ОбновитьЭлементыФормы();
		//пересчитаем сумму распределения в валюте документа, т.к. сменился курс валюты
		ОбработкаТабличныхЧастейСервер.ПересчитатьИзВалютыВВалюту(Объект.РаспределениеПлатежа, Объект.Валюта, Объект.Дата);
	КонецЕсли;
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	КонтрагентПриИзмененииНаСервере();
	ПересчитатьБонусыПоДокументу();
	
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		РеквизитыКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Контрагент, "ОсновнойДоговор, Категория");	
		Объект.Договор = РеквизитыКонтрагента.ОсновнойДоговор;
		Объект.КатегорияКонтрагента = РеквизитыКонтрагента.Категория;
	Иначе
		Объект.Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		Объект.КатегорияКонтрагента = Справочники.КатегорииКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
	//Элементы.КонтрагентДополнительно.Видимость = Объект.Контрагент.ПоказыватьДопИнформацию;
	ОбщийМодульСервер.ДополнительнаяИнформацияПоКонтрагентуНаФорме(Объект.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	ОбщийМодульСервер.РегулировкаШириныПоляКонтрагента(Элементы, Элементы.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПлатежнойКартыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ПолучитьСписокДоступныхВидовПлатежныхКарт(Объект.ЭквайринговыйТерминал);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПлатежнойКартыПриИзменении(Элемент)
	
	ЗаполнитьПроцентКомиссии();
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
			
	ДополнительныеПараметры = Новый Структура("СтараяСуммаДокумента", СтараяСуммаДокумента);
	ВыполнитьРаспределениеОплаты(ДополнительныеПараметры);
	
	СуммаПриИзмененииКлиент();
	 
КонецПроцедуры

// Экспорт - вызывается из ФинансыКлиент 
&НаКлиенте
Процедура СуммаПриИзмененииКлиент() Экспорт
	
	Объект.Комиссия = Объект.Сумма * (Объект.ПроцентКомиссии / 100);
	
	СтараяСуммаДокумента = Объект.Сумма;
	
	ФинансыКлиентСервер.ПересчитатьСуммуНДС(Объект, УчитыватьНДС);
	ПересчитатьБонусыПоДокументу();
	 
КонецПроцедуры

&НаКлиенте
Процедура ПроцентКомиссииПриИзменении(Элемент)
	
	Объект.Комиссия = Объект.Сумма * (Объект.ПроцентКомиссии / 100);
	
КонецПроцедуры

&НаКлиенте
Процедура КомиссияПриИзменении(Элемент)
	
	Если НЕ Объект.Сумма = 0 Тогда
		Объект.ПроцентКомиссии = Окр(Объект.Комиссия / Объект.Сумма,2);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	//++ №11237 нужно пересчитать из валюты в валюту если она поменялась, предварительно уточнив у пользователя
	//ОбновитьЭлементыФормы();
	Если ЗначениеЗаполнено(Объект.Валюта) И НЕ ВалютаДокумента = Объект.Валюта Тогда
		
		ТекстВопроса = "Пересчитать суммы документа по курсу новой валюты?";
		ОписаниеОповещения = Новый ОписаниеОповещения("ВалютаПриИзмененииФрагмент", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ВалютаПриИзмененииЗавершение();
		
	КонецЕсли;
	//-- №11237
	
КонецПроцедуры

//++ №11237
&НаКлиенте
Процедура ВалютаПриИзмененииФрагмент(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ВалютаПриИзмененииСервер(Объект.Валюта,	Истина);		
	Иначе
		Объект.Валюта = ВалютаДокумента;
	КонецЕсли;
	
	ВалютаПриИзмененииЗавершение();
		
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзмененииЗавершение()
	
	ВалютаДокумента = Объект.Валюта;
	
	ОбновитьЭлементыФормы();
		
КонецПроцедуры 

&НаСервере
Процедура ВалютаПриИзмененииСервер(НоваяВалюта, ПересчитатьСуммы = Истина)
		
	Если ПересчитатьСуммы Тогда 
		
		СтараяВалюта = ВалютаДокумента;
		ДатаКурса    = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса());
		
		Объект.Сумма = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(СтараяВалюта, НоваяВалюта, ДатаКурса, Объект.Сумма);
		РаспределитьСуммуОплатыПоДокументам();
		
	КонецЕсли;
		
КонецПроцедуры
//-- №11237

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ЗаполнитьСтавкуНДСПоОрганизации();
	ПересчитатьБонусыПоДокументу();
	
КонецПроцедуры

&НаКлиенте
Процедура КассаПриИзменении(Элемент)
	// №6876 ПересчитатьБонусыПоДокументу(); расчет бонусов теперь по эквайрингу
КонецПроцедуры

&НаСервере
Процедура ЭквайринговыйТерминалПриИзмененииНаСервере()
	
	Объект.ВидПлатежнойКарты = Справочники.ВидыПлатежныхКарт.ПустаяСсылка();
	Если ЗначениеЗаполнено(Объект.ЭквайринговыйТерминал) Тогда
		ОтборСтрок = Новый Структура("Основная", Истина);
		НайденныеСтроки = Объект.ЭквайринговыйТерминал.ВидыПлатежныхКарт.НайтиСтроки(ОтборСтрок);
		Если НайденныеСтроки.Количество() > 0 Тогда
			Объект.ВидПлатежнойКарты = НайденныеСтроки[0].ВидПлатежнойКарты; 	
			Объект.ПроцентКомиссии = НайденныеСтроки[0].ПроцентКомиссии;
		КонецЕсли;
	КонецЕсли;
	Объект.БанкВозвращаетКомиссиюПриВозвратеОплаты = Объект.ЭквайринговыйТерминал.БанкВозвращаетКомиссиюПриВозвратеОплаты;

КонецПроцедуры

&НаКлиенте
Процедура ЭквайринговыйТерминалПриИзменении(Элемент)
	ЭквайринговыйТерминалПриИзмененииНаСервере();
	ПроцентКомиссииПриИзменении(Неопределено);
	ПересчитатьБонусыПоДокументу(); // №6876
КонецПроцедуры

&НаКлиенте
Процедура ДисконтнаяКартаПриИзменении(Элемент)
	ПересчитатьБонусыПоДокументу();
КонецПроцедуры

&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	ФинансыКлиентСервер.ПересчитатьСуммуНДС(Объект, УчитыватьНДС);	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТЧРаспределение

&НаКлиенте
Процедура РаспределениеПлатежаДатаПлатежаПоРассрочкеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.РаспределениеПлатежа.ТекущиеДанные;
	Если ТипЗнч(ТекущиеДанные.Документ) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
		СписокВариантов = ПолучитьДатыОплатыПоДоговоруРассрочки(ТекущиеДанные.Документ);
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыборДатыПлатежаПоРассрочке", ЭтаФорма);
		ПоказатьВыборИзМеню(ОписаниеОповещения, СписокВариантов, Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборДатыПлатежаПоРассрочке(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт 
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Элементы.РаспределениеПлатежа.ТекущиеДанные.ДатаПлатежаПоРассрочке = ВыбранныйЭлемент.Значение;
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПлатежаДатаПлатежаПоРассрочкеНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПлатежаДатаПлатежаПоРассрочкеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ПоказатьОповещениеПользователя("Сообщение", , "Дату следует выбирать согласно предложенных вариантов");
	Элементы.РаспределениеПлатежа.ТекущиеДанные.ДатаПлатежаПоРассрочке = Дата(1,1,1);
	Возврат;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийИКоманд_ТЧРаспределение

&НаКлиенте
Процедура Распределение_Документ(Команда)
	ФинансыКлиент.Распределение_Документ(Команда, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПлатежаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
//Процедура ПослеВыбораДокумента(ВыбранныйДокумент, ДополнительныеПараметры) Экспорт
	
	Для каждого ВыбранныйДокумент из ВыбранноеЗначение Цикл
		Если НЕ ВыбранныйДокумент.Пустая() Тогда
			НоваяСтрока = Объект.РаспределениеПлатежа.Добавить();
			НоваяСтрока.Документ = ВыбранныйДокумент;
			//НоваяСтрока.Сумма = ПолучитьСуммуДокумента(НоваяСтрока.Документ);
			НоваяСтрока.Сумма = Объект.Сумма;
			
			Если ДобавлятьЗаказыВторогоПорядкаВРаспределение Тогда
				ДобавитьОснованиеЗаказаСервер(НоваяСтрока.Документ);
			КонецЕсли;			
			//#7709
			Если ДобавлятьДокументыПродажиПоЗаказамПокупателей ИЛИ ДобавлятьДокументыПродажиПоЗаказДоговорам Тогда
				ДобавитьДокументыПродажиПоЗаказамСервер(НоваяСтрока.Документ);	
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ВыбранноеЗначение.Количество() > 0 Тогда
		РаспределениеОплаты(Неопределено);
		ОбновитьЭлементыФормы();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПлатежаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если НоваяСтрока Тогда
		РаспределениеОплаты(Неопределено);
		ОбновитьЭлементыФормы();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПлатежаПослеУдаления(Элемент)
	РаспределениеОплаты(Неопределено);
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеОплаты(Команда)
	//Если Объект.РаспределениеПлатежа.Количество() = 0 Тогда
	//	Возврат;
	//Конецесли;
	//
	//Если Объект.Проведен Тогда
	//	ОповещениеВопрос = Новый ОписаниеОповещения("ОповещениеВопросОтменаПроведениеПередРаспределением", ЭтаФорма);
	//	ПоказатьВопрос(ОповещениеВопрос, "Будет произведено распределение суммы по документам и документ будет распроведен. Продолжить?", РежимДиалогаВопрос.ДаНет); 
	//Иначе
	//	РаспределитьСуммуОплатыПоДокументам();
	//	Модифицированность = Истина;
	//КонецЕсли;
		
	ВыполнитьРаспределениеОплаты();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьРаспределениеОплаты(ДополнительныеПараметры=Неопределено)

	ОписаниеОповещенияОбновитьДанные = Новый ОписаниеОповещения("ОписаниеОповещенияОбновитьДанные", ЭтотОбъект);
	ФинансыКлиент.РаспределениеОплаты(ЭтаФорма, "РаспределениеПлатежа", СтрокиРаспределенияПлатежей(), Объект.Сумма, ОписаниеОповещенияОбновитьДанные, ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Функция СтрокиРаспределенияПлатежей()
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Объект.РаспределениеПлатежа.Выгрузить());
	
КонецФункции

&НаКлиенте
Процедура ОписаниеОповещенияОбновитьДанные(Результат, ДополнительныеПараметры) Экспорт
	ОбновитьЭлементыФормы();
КонецПроцедуры
	 
//&НаКлиенте
//Процедура ОповещениеВопросОтменаПроведениеПередРаспределением(РезультатВопроса, ДополнительныеПараметры) Экспорт
//	
//	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
//		Если Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения)) Тогда
//			РаспределитьСуммуОплатыПоДокументам();
//			ОповещениеВопрос = Новый ОписаниеОповещения("ОповещениеВопросПроведениеПослеРаспределения", ЭтаФорма);
//			ПоказатьВопрос(ОповещениеВопрос, "Провести документ?", РежимДиалогаВопрос.ДаНет);
//			//Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
//		КонецЕсли;
//	Иначе
//		Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
//			Если ДополнительныеПараметры.Свойство("СтараяСуммаДокумента") Тогда	
//				Объект.Сумма = ДополнительныеПараметры.СтараяСуммаДокумента;
//				СтараяСуммаДокумента = ДополнительныеПараметры.СтараяСуммаДокумента;
//				Объект.Комиссия = Объект.Сумма * (Объект.ПроцентКомиссии / 100);
//			КонецЕсли;
//		КонецЕсли;
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ОповещениеВопросПроведениеПослеРаспределения(РезультатВопроса, ДополнительныеПараметры) Экспорт
//	
//	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
//		Если НЕ Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда
//			Модифицированность = Истина;
//		КонецЕсли;
//	Иначе
//		Модифицированность = Истина;
//	КонецЕсли;
//	
//КонецПроцедуры

&НаСервере
Процедура РаспределитьСуммуОплатыПоДокументам()
	
	ОбработкаТабличныхЧастейСервер.РаспределитьСуммуОплатыПоДокументам(СтрокиРаспределенияПлатежей(), Объект.Сумма, Объект.Дата);
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереплатаНаПоследнийДокумент(Команда)
	РаспределитьПереплатуНаПоследнийДокумент();
	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура РаспределитьПереплатуНаПоследнийДокумент()
	ОбработкаТабличныхЧастейСервер.РаспределитьПереплатуНаПоследнийДокумент(Объект.РаспределениеПлатежа, Объект.Сумма, Объект.Дата);
	ОбновитьЭлементыФормы();
КонецПроцедуры 

&НаКлиенте
Процедура РаспределениеПлатежаСуммаПриИзменении(Элемент)
	
	// №7373 нужно определить различие в валютах, чтобы корректно отображать определенные колонки и суммы
	ВалютаЗаказаРавнаВалютеДокумента = ОпределитьРазличиеВалютыЗаказаИВалютыДокументаНаСервере();
	
	ТекущаяСтрока = Элементы.РаспределениеПлатежа.ТекущиеДанные;
	Если НЕ (Объект.Валюта = ВалютаУчета И ВалютаЗаказаРавнаВалютеДокумента) И НЕ ТекущаяСтрока = Неопределено Тогда
		ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьИзВалютыВВалютуВСтрокеТЧ(ТекущаяСтрока, Объект.Валюта, Объект.Дата);
	КонецЕсли;		
	ОбновитьНадписиРаспеределениеПлатежаНаСервере(ВалютаЗаказаРавнаВалютеДокумента);
	
КонецПроцедуры

&НаСервере
Функция ОпределитьРазличиеВалютыЗаказаИВалютыДокументаНаСервере()
	
	Возврат ФинансыСервер.ОпределитьРазличиеВалютыЗаказаИВалютыДокумента(Объект);
	
КонецФункции

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ОбщийМодульКлиент.Провести(ЭтаФорма, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ОбщийМодульКлиент.ПровестиИЗакрыть(ЭтаФорма, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщийМодульКлиент.Записать(ЭтаФорма, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьТовары(Команда)
	Элементы.ГруппаТовары.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЧека(Команда)
	
	//#6876 закомментировано
	//Если Объект.Касса.Пустая() Тогда
	//	ТекстСообщения = НСтр("ru = 'Укажите кассу!'");
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	//	Возврат;
	//КонецЕсли;


	Если Объект.ЧекФискализирован Тогда
		ТекстСообщения = НСтр("ru = 'Чек уже пробит на оборудовании!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	//++ №7951 необходимо проверить права на объекты распределения, как минимум должно быть чтение
	Если НЕ ПотолкиКассыОнлайн.ПроверитьДоступКДокументамРаспределения(Объект) Тогда
		Возврат;
	КонецЕсли;	
	//-- №7951
		
	ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеВопросПроведениеПередПечатьюЧека", ЭтотОбъект);	
	Если ПотолкиКассыОнлайнКлиент.ПроверитьВозможностьПечатиЧека(ОбработчикОповещения, ЭтотОбъект) Тогда
		ПечатьЧекаКлиент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЧекаКлиент()
	
	//#9147
	ПараметрыЭквайринговойОперации = Неопределено;
	Если (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийОплатаБанковскойКартой.ОплатаБанковскойКартой")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийОплатаБанковскойКартой.ВозвратОплатыКлиенту")) 
		И НЕ Объект.ОплатаВыполнена Тогда
		
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийОплатаБанковскойКартой.ОплатаБанковскойКартой") Тогда
			ТипТранзакции = "AuthorizeSales";
		Иначе
			ТипТранзакции = "AuthorizeRefund";
		КонецЕсли;
		
		ПараметрыЭквайринговойОперации = Новый Структура;;
		ПараметрыЭквайринговойОперации.Вставить("Сумма",         Объект.Сумма);
		ПараметрыЭквайринговойОперации.Вставить("ТипТранзакции", ТипТранзакции);		
	КонецЕсли;
		
	ПараметрыОперации = Новый Структура;
	ПараметрыОперации.Вставить("ДокументСсылка",           Объект.Ссылка);
	ПараметрыОперации.Вставить("Партнер",                  Объект.Контрагент);
	ПараметрыОперации.Вставить("Организация",              Объект.Организация);
	//ПараметрыОперации.Вставить("ПодключенноеОборудование", Неопределено); //ФискальнаяОперацияПодключенноеОборудование);
	
	//#9147
	ПараметрыОперации.Вставить("ПараметрыЭквайринговойОперации", ПараметрыЭквайринговойОперации);	
	ПодключенноеОборудование = ПодключаемоеОборудованиеПотолкиВызовСервера.ОборудованиеПодключенноеКТерминалу(Объект.ЭквайринговыйТерминал);
	ПараметрыОперации.Вставить("ПодключенноеОборудование",       ПодключенноеОборудование);	
	
	ОписаниеОповещенияПриЗавершении = Новый ОписаниеОповещения("ФискализацияЧека_Завершение", ЭтотОбъект);
	ОткрытьФорму(
			"Обработка.ПредпросмотрЧека.Форма",
			ПараметрыОперации,
			ЭтотОбъект,,,,
			ОписаниеОповещенияПриЗавершении);
			
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеВопросПроведениеПередПечатьюЧека(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Если Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда
			ПечатьЧекаКлиент();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФискализацияЧека_Завершение(РезультатВыполнения, Параметры) Экспорт
	
	Если НЕ РезультатВыполнения = Неопределено И НЕ РезультатВыполнения = КодВозвратаДиалога.Отмена Тогда
		Если РезультатВыполнения.Результат Тогда
			// Установить полученное значение номера чека реквизиту документа.
			Объект.НомерСменыККМ = РезультатВыполнения.НомерСмены;
			Объект.НомерЧекаККМ = РезультатВыполнения.НомерЧекаККМ;
			
			Объект.ЧекФискализирован = Истина;;
			Объект.Дата = МенеджерОборудованияКлиентПереопределяемый.ДатаСеанса();
			Если Не ЗначениеЗаполнено(Объект.НомерЧекаККМ) Тогда
				Объект.НомерЧекаККМ = 1;
			КонецЕсли;
			
			Если РезультатВыполнения.ВерсияФФД = "1.0" Тогда
				ЗаполнитьТаблицуТоваровПоОснованиюНаСервере();
			КонецЕсли;
			
			ПараметрыЗаписи = Новый Структура("РежимЗаписи, РежимПроведения",
				РежимЗаписиДокумента.Проведение,
				РежимПроведенияДокумента.Оперативный);
			ЗаписьПослеПробития = Истина; // #15647

			Если ЗаписатьДокументНаСервере(ПараметрыЗаписи) Тогда
				//
			Иначе
				ТекстСообщения = НСтр("ru = 'Ошибка записи документа'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
		Иначе
			ТекстСообщения = РезультатВыполнения.ОписаниеОшибки;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписьЖурналаФискальныхОпераций(Команда)
	
	ФискальнаяОперацияДанныеЖурнала = Неопределено;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ФискальнаяОперацияДанныеЖурнала = ПотолкиКассыОнлайн.ДанныеЖурналаФискальныхОпераций(Объект.Ссылка);
	КонецЕсли;
	Если ФискальнаяОперацияДанныеЖурнала = Неопределено Тогда
		Сообщить("Документ не проведен, не пробит чек или отсутствует запись в журнале");
	Иначе
		ПотолкиКассыОнлайнКлиент.ОткрытьЗаписьЖурналаФискальныхОпераций(ЭтотОбъект, ФискальнаяОперацияДанныеЖурнала);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДополнительнуюИнформацию(Команда)
	
	ОбщийМодульКлиент.ФормаДополнительнойИнформацииКонтрагента(Объект.Контрагент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуОтправитьСообщениеМессенджер(Команда)
	МессенджерыКлиент.ВыполнитьКомандуОтправитьСообщениеМессенджер(Команда, ЭтаФорма, Объект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьЭлементыФормы()
	
	// №7373 нужно определить различие в валютах, чтобы корректно отображать определенные колонки и суммы
	ВалютаЗаказаРавнаВалютеДокумента = ФинансыСервер.ОпределитьРазличиеВалютыЗаказаИВалютыДокумента(Объект);
	
	СписокДокументовРаспределения = Объект.РаспределениеПлатежа.Выгрузить(,"Документ");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетыПоЗаказамОстатки.СуммаОстаток КАК ОсталосьРаспределить,
	|	РасчетыПоЗаказамОстатки.Заказ КАК Заказ,
	|	РасчетыПоЗаказамОстатки.Заказ.СуммаДокумента КАК СуммаДокумента,
	|	РасчетыПоЗаказамОстатки.Заказ.Валюта КАК Валюта
	|ИЗ
	|	РегистрНакопления.РасчетыПоЗаказам.Остатки(, Заказ В (&Заказ)) КАК РасчетыПоЗаказамОстатки";
	Запрос.УстановитьПараметр("Заказ", СписокДокументовРаспределения);
	ТаблицаПоДокументам = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаРаспределения Из Объект.РаспределениеПлатежа Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Заказ", СтрокаРаспределения.Документ);
		НайденныеСтроки = ТаблицаПоДокументам.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда
			//ЗаполнитьЗначенияСвойств(СтрокаРаспределения, НайденныеСтроки[0]);
			Если Объект.Валюта = ВалютаУчета И ВалютаЗаказаРавнаВалютеДокумента Тогда 
				ЗаполнитьЗначенияСвойств(СтрокаРаспределения, НайденныеСтроки[0]);
			Иначе
				СтрокаРаспределения.ВалютаДокумента = НайденныеСтроки[0].Валюта; 
				СтрокаРаспределения.СуммаДокументаВВалютеДокумента = НайденныеСтроки[0].СуммаДокумента;
				СтрокаРаспределения.СуммаДокумента = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(НайденныеСтроки[0].Валюта, Объект.Валюта, Объект.Дата, НайденныеСтроки[0].СуммаДокумента);
				СтрокаРаспределения.ОсталосьРаспределить = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(НайденныеСтроки[0].Валюта, Объект.Валюта, Объект.Дата, НайденныеСтроки[0].ОсталосьРаспределить);
			КонецЕсли;
		Иначе
			Попытка
				//СтрокаРаспределения.СуммаДокумента = СтрокаРаспределения.Документ.СуммаДокумента;
				Если Объект.Валюта = ВалютаУчета И ВалютаЗаказаРавнаВалютеДокумента Тогда
					СтрокаРаспределения.СуммаДокумента = СтрокаРаспределения.Документ.СуммаДокумента;
				Иначе
					СтрокаРаспределения.ВалютаДокумента = СтрокаРаспределения.Документ.Валюта; 
					СтрокаРаспределения.СуммаДокументаВВалютеДокумента = СтрокаРаспределения.Документ.СуммаДокумента;
					СтрокаРаспределения.СуммаДокумента = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(СтрокаРаспределения.Документ.Валюта, Объект.Валюта, Объект.Дата, СтрокаРаспределения.Документ.СуммаДокумента);
				КонецЕсли;
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	ФинансыСервер.ОбновитьНадписиРаспеределениеПлатежа(ЭтаФорма, Объект, , ВалютаУчета, ВалютаЗаказаРавнаВалютеДокумента);
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКнопокРаспределения()
	Элементы.РаспределениеПлатежаРаспределение_ЗаказДоговор.Видимость 		 = Константы.ВестиРасчетыПоЗаказамПоЗаказДоговору.Получить();
	Элементы.ГруппаРаспределениеЗаказДоговор.Видимость = Элементы.РаспределениеПлатежаРаспределение_ЗаказДоговор.Видимость;
	
	Элементы.РаспределениеПлатежаРаспределение_СчетНаОплату.Видимость 		 = Константы.ВестиРасчетыПоЗаказамПоСчетуНаОплату.Получить();
	Элементы.ГруппаРаспределениеСчетНаОплату.Видимость = Элементы.РаспределениеПлатежаРаспределение_СчетНаОплату.Видимость;
	
	//НАЧАЛО: Переход на 2.0
	//Элементы.РаспределениеПлатежаРаспределение_ЗаказНаПроизводство.Видимость = Константы.ВестиРасчетыПоЗаказамПоЗаказуНаПроизводство.Получить();
	//Элементы.ГруппаРаспределениеЗаказНаПроизводство.Видимость = Элементы.РаспределениеПлатежаРаспределение_ЗаказНаПроизводство.Видимость;
	//КОНЕЦ: Переход на 2.0
	
	Элементы.РаспределениеПлатежаРаспределение_ЗаказПокупателя.Видимость	 = Константы.ВестиРасчетыПоЗаказамПоЗаказуПокупателя.Получить();
	Элементы.ГруппаРаспределениеЗаказПокупателя.Видимость = Элементы.РаспределениеПлатежаРаспределение_ЗаказПокупателя.Видимость;
	
	Элементы.РаспределениеПлатежаРаспределение_Реализация.Видимость 		 = Константы.ВестиРасчетыПоЗаказамПоРТиУ.Получить();
	Элементы.ГруппаРаспределениеРТиУ.Видимость = Элементы.РаспределениеПлатежаРаспределение_Реализация.Видимость;
	
	Элементы.РаспределениеПлатежаРаспределение_Монтаж.Видимость				 = Константы.ВестиРасчетыПоЗаказамПоМонтажу.Получить();
	Элементы.ГруппаРаспределениеМонтаж.Видимость = Элементы.РаспределениеПлатежаРаспределение_Монтаж.Видимость; 
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокДоступныхВидовПлатежныхКарт(Эквайринговыйтерминал)
	
	Результат = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЭквайринговыеТерминалыВидыПлатежныхКарт.ВидПлатежнойКарты
	|ИЗ
	|	Справочник.ЭквайринговыеТерминалы.ВидыПлатежныхКарт КАК ЭквайринговыеТерминалыВидыПлатежныхКарт
	|ГДЕ
	|	ЭквайринговыеТерминалыВидыПлатежныхКарт.Ссылка = &Эквайринговыйтерминал";
	Запрос.УстановитьПараметр("Эквайринговыйтерминал",Эквайринговыйтерминал);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.ВидПлатежнойКарты);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПроцентКомиссии()
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ТекущийОбъект.ЗаполнитьПроцентКомиссии();
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьОснованиеЗаказаСервер(ОбъектОснование)
	ФинансыСервер.ДобавитьОснованиеЗаказаВРаспределениеПлатежа(ОбъектОснование, Объект.РаспределениеПлатежа, Объект.Сумма);
	//ДокументОбъект = РеквизитФормыВЗначение("Объект");
	//ДокументОбъект.ДобавитьОснованиеЗаказа(ОбъектОснование);
	//ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
КонецПроцедуры

&НаСервере
Процедура ДобавитьДокументыПродажиПоЗаказамСервер(ОбъектОснование)
	ФинансыСервер.ДобавитьДокументыПродажиПоЗаказам(Объект, ОбъектОснование);
КонецПроцедуры

&НаСервере
Функция ПолучитьСуммуДокумента(Ссылка)
	Если НЕ Ссылка.Метаданные().Реквизиты.Найти("СуммаДокумента") = Неопределено Тогда 
		Возврат Ссылка.СуммаДокумента;
	ИначеЕсли НЕ Ссылка.Метаданные().Реквизиты.Найти("Сумма") = Неопределено Тогда 
		Возврат Ссылка.Сумма;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДатыОплатыПоДоговоруРассрочки(СсылкаНаЗаказ)
	
	Возврат ФинансыСервер.ПолучитьДатыОплатыПоДоговоруРассрочки(СсылкаНаЗаказ);
	
КонецФункции

// Функция записи и проведения документа.
//
&НаСервере
Функция ЗаписатьДокументНаСервере(ПараметрыЗаписи)
	
	Попытка
		Результат = Записать(ПараметрыЗаписи);
	Исключение
		ТекстСообщения = НСтр("ru = 'Не удалось провести документ'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЗаполнитьТаблицуТоваровПоОснованиюНаСервере()
	//Возврат Документы.ПриходныйКассовыйОрдер.ЗаполнитьТаблицуТоваровПоОснованию(Объект.Ссылка);
	ТаблицаТоваров = Документы.ПриходныйКассовыйОрдер.ЗаполнитьТаблицуТоваровПоОснованию(Объект.Ссылка);
	Объект.Товары.Очистить();
	Для каждого СтрокаТЗ из ТаблицаТоваров Цикл
		НоваяСтрока = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
	КонецЦикла;
КонецФункции

&НаСервере
Процедура ОбновитьНадписиРаспеределениеПлатежаНаСервере(ВалютаЗаказаРавнаВалютеДокумента)
	
	ФинансыСервер.ОбновитьНадписиРаспеределениеПлатежа(ЭтаФорма, Объект, , ВалютаУчета, ВалютаЗаказаРавнаВалютеДокумента);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьГруппыБонусов()
	
	Элементы.ГруппаБонусыТекущиеДанные.Видимость = Объект.НачислятьБонусы;
	Элементы.ДисконтнаяКарта.Видимость = Объект.НачислятьБонусы И Объект.СлужебныйУчетБонусовПоДисконтнымКартам;
		
КонецПроцедуры

&НаСервере
Процедура ПересчитатьБонусыПоДокументу()
	
	Объект.СуммаБонусовКНачислениюПоДисконтнойКарте = 0;
	
	Если Объект.НачислятьБонусы 
		И (Объект.ВидОперации = Перечисления.ВидыОперацийОплатаБанковскойКартой.ОплатаБанковскойКартой
		   ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийОплатаБанковскойКартой.ВозвратОплатыКлиенту)
		Тогда		
		//Объект.СуммаБонусовКНачислениюПоДисконтнойКарте = БонусыСервер.ПолучитьСуммуБонусовКНачислениюПоДокументуОплаты(Объект.Дата, Объект.Организация, Объект.Контрагент.Категория, Объект.ЭквайринговыйТерминал, Объект.Сумма, Объект.Ссылка, Объект.ДисконтнаяКарта, Объект.СлужебныйУчетБонусовПоДисконтнымКартам);
		СтруктураБонусов = БонусыСервер.ПолучитьСуммуБонусовКНачислениюПоДокументуОплаты(Объект.Дата, Объект.Организация, Объект.КатегорияКонтрагента, Объект.ЭквайринговыйТерминал, Объект.Сумма, Объект.Ссылка, Объект.ДисконтнаяКарта, Объект.СлужебныйУчетБонусовПоДисконтнымКартам);
		Объект.СуммаБонусовКНачислениюПоДисконтнойКарте = СтруктураБонусов.СуммаБонусов;
		Объект.ДокументНАНБ = СтруктураБонусов.ДокументНАНБ;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗакрытьФорму()
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьЗаписьОбъекта()
	
	ОбщийМодульКлиент.ОбработатьЗаписьОбъектаВФорме(ЭтотОбъект, ПараметрыДляЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПроверкиИЗадатьВопросыПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПараметрыЗаписи", ПараметрыЗаписи);
	ДополнительныеПараметры.Вставить("ЭтотОбъект", ЭтотОбъект);
	
	Отказ = Ложь;
	
	Если ЗначениеЗаполнено(Объект.Ссылка)
		И Объект.НачислятьБонусы 
		И НЕ мСуммаБонусов = Объект.СуммаБонусовКНачислениюПоДисконтнойКарте Тогда
		
		Отказ = Истина;
		ОписаниеОповещения = Новый ОписаниеОповещения("ИзменениеБонусовПодтверждениеПередЗаписью", ЭтотОбъект, ДополнительныеПараметры);
		БонусыКлиент.ПодтвердитьИзменениеСуммыБонусов(ОписаниеОповещения, Объект.СуммаБонусовКНачислениюПоДисконтнойКарте, мСуммаБонусов);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеБонусовПодтверждениеПередЗаписью(ОтветНаВопрос, ДополнительныеПараметры) Экспорт
	
	Отказ = Ложь;
	
	Если ОтветНаВопрос = КодВозвратаДиалога.Да Тогда
		Отказ = Ложь;
	Иначе
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.Вставить("Отказ", Отказ);
	ОбщийМодульКлиент.ЗаписатьОбъектПриНеобходимости(ЭтотОбъект, ДополнительныеПараметры.ПараметрыЗаписи,, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтавкуНДСПоОрганизации(ТолькоИзменениеФормы = Ложь)
	
	УчитыватьНДС = УчетНДС.ОрганизацияЯвляетсяПлательщикомНДС(Объект.Организация);
	Элементы.ГруппаНДС.Видимость = УчитыватьНДС;
	
	Если НЕ ТолькоИзменениеФормы Тогда
		Объект.СтавкаНДС = УчетНДС.СтавкаНДСПоУмолчанию(Объект.Организация);	
		ФинансыКлиентСервер.ПересчитатьСуммуНДС(Объект, УчитыватьНДС);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

&НаКлиенте
Процедура ЗаполнитьОснованияПоРаспределениюКоманда(Команда)
	
	Если Объект.Основания.Количество() > 0 Тогда
		ПоказатьВопрос(новый ОписаниеОповещения("ПослеВопросаОбОчищенииТаблицыОснования", ЭтотОбъект), "Табличная часть основания будет очищена, продолжить?", РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьОснованияПоРаспределению();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбОчищенииТаблицыОснования(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Объект.Основания.Очистить();
		ЗаполнитьОснованияПоРаспределению();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОснованияПоРаспределению()
	
	ОбработкаТабличныхЧастейСервер.ЗаполнитьОснованияПоРаспределению(Объект.Основания, Объект.РаспределениеПлатежа);
		
КонецПроцедуры	

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	ВидОперацииПриИзмененииНаСервере();
	УстановитьЗаголовок();
	УправлениеВидимостьюЭлементов();
КонецПроцедуры

&НаСервере
Процедура ВидОперацииПриИзмененииНаСервере()
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийОплатаБанковскойКартой.ВозвратОплатыКлиенту Тогда
		Если НЕ Объект.БанкВозвращаетКомиссиюПриВозвратеОплаты Тогда
			Объект.ПроцентКомиссии = 0;
			Объект.Комиссия = 0;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура БанкВозвращаетКомиссиюПриВозвратеОплатыПриИзменении(Элемент)
	УправлениеВидимостьюЭлементов();
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостьюЭлементов()
	
	ОперацияОплатаКартой = (Объект.ВидОперации = Перечисления.ВидыОперацийОплатаБанковскойКартой.ОплатаБанковскойКартой)
					   ИЛИ (Объект.ВидОперации = Перечисления.ВидыОперацийОплатаБанковскойКартой.ВозвратОплатыКлиенту);
	
	Элементы.КредитныйДоговор.Видимость 	 = (НЕ ОперацияОплатаКартой);
	Элементы.ВидПлатежнойКарты.Видимость  	 = ОперацияОплатаКартой;
	Элементы.ЭквайринговыйТерминал.Видимость = ОперацияОплатаКартой;
	
	Элементы.БанкВозвращаетКомиссиюПриВозвратеОплаты.Видимость = (Объект.ВидОперации = Перечисления.ВидыОперацийОплатаБанковскойКартой.ВозвратОплатыКлиенту);
	
	//#11129
	//Элементы.СтатьяРасходов.Видимость = (Объект.ВидОперации = Перечисления.ВидыОперацийОплатаБанковскойКартой.ВозвратОплатыКлиенту);
	//Элементы.СтатьяДоходов.Видимость  = НЕ Элементы.СтатьяРасходов.Видимость;
	Элементы.СтатьяРасходов.Видимость = Ложь;
	Элементы.СтатьяДоходов.Видимость  = Ложь;
	
	УстанавливаетсяКомиссия = НЕ Объект.ВидОперации = Перечисления.ВидыОперацийОплатаБанковскойКартой.ВозвратОплатыКлиенту 
								ИЛИ Объект.БанкВозвращаетКомиссиюПриВозвратеОплаты;
	Элементы.ПроцентКомиссии.Доступность = УстанавливаетсяКомиссия;
	Элементы.Комиссия.Доступность = УстанавливаетсяКомиссия;
		
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовок()
	
	АвтоЗаголовок = Ложь;
	Заголовок = Документы.ОплатаБанковскойКартой.ЗаголовокДокументаПоВидуОперации(Объект.Ссылка,
																						  Объект.Номер,
																						  Объект.Дата,
																						  Объект.ВидОперации);
	
КонецПроцедуры
